---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
source: html/89b85ea2-6e9e-bef0-bb40-0ba398f58cb0.htm
---
# VertexPositionColored Properties

Specifies whether the .NET object represents a valid Revit entity.